<template>
	<div>

		<div class="title">
			<img src="../assets/arrow.png" @click="back">
			5G测速大师用户许可协议
		</div>
		<div>
			<p>引言：</p>
			<p>本协议是您与杭州鸿大网络发展股份有限公司（以下简称“本公司”）之间关于使用“5G测速大师”服务所订立的协议。本协议描述本公司与您之间关于本软件服务相关方面的权利义务。5G测速大师在此特别提醒您在使用本软件前认真阅读、充分理解本《用户许可协议》（以下简称“本协议”）。您在手机或其他设备（以下统称“设备”）上使用5G测速大师Android平台客户端（以下简称“本软件”）即表明您已经阅读、理解并同意受本协议条款和其他适用法律约束。</p>
			<p>2.用户权利与义务：</p>
			<p>您应遵守本协议的各项条款，正确、适当地使用本软件所提供的服务。</p>
			<p>为保证5G测速大师的适用性以及您的使用体验，请您及时下载最新版本并升级。</p>
			<p>本协议未明示授权的其他一切权利仍归本公司所有。除非有书面明示，本公司不放弃或转让相关权益或对相关权益进行其他授权或许可。</p>
			<p>3.保护您隐私郑重声明：</p>
			<p>5G测速大师不会未经您许可获取您隐私信息包括但不限于身份信息、WiFi密码、网络访问记录、银行账号以及其他财务类信息，除《5G测速大师隐私协议》中另有规定的情形外，未经您许可，5G测速大师不会对外披露或向第三方提供您的任何信息。</p>
			<p>本条隐私权声明不适用于任何向您提供服务的第三方主体，包括那些可能向5G测速大师披露信息的第三方。</p>
			<p>其他涉及用户隐私的具体内容，请参见《5G测速大师隐私协议》。</p>
			<p>4.知识产权及商业秘密：</p>
			<p>本软件服务中所涉及的图形、文字或其组成，以及其他本公司标志及产品、服务名称，均为本公司之商标。未经本公司事先书面同意，您不得以营利为目的将本公司标识以任何方式展示或使用或作其他处理，也不得向他人表明您有权展示、使用、或其他有权处理本公司标识的行为。</p>
			<p>本软件全部知识产权为杭州鸿大网络发展股份公司所有，包括受《中华人民共和国著作权法》、《中华人民共和国商标法》或《中华人民共和国专利法》及其实施条例等法律法规所保护的一切智力成果。</p>
			<p>本软件所涉及的一切著作权、商标权、专利权等知识产权，以及与本软件相关的所有商业秘密及信息内容均受中华人民共和国法律法规和相应的国际条约保护，本公司对上述内容享有一切权利。</p>
			<p>未经本公司许可，您不得修改5G测速大师的客户端程序，不得对5G测速大师进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble），不得破坏其完整性（包括程序代码、数据等）。</p>
			<p>未经本公司许可，您不得制作、传播有损本公司利益或扰乱软件正常使用秩序的任何第三方软件。</p>
			<p>5.法律责任与免责声明：</p>
			<p>您违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，您同意赔偿本公司与合作公司、关联公司以及其他用户，并使之免受损害。</p>
			<p>对于因不可抗力而造成的服务器的死机、网络的中断，以及软件升级时的服务暂停等，进而对本服务用户造成的损失，服务方不承担任何责任。</p>
			<p>您不可转让本协议书或其中所述之任何权利。</p>
			<p>6.本协议的变更：</p>
			<p>5G测速大师有权在任何时间修改本协议条款，并于公布在平台之时起生效。如果5G测速大师对我们处理您个人信息的方式或本协议做出重大变更，我们将通过有关服务向您提供通知。我们鼓励您定期阅读本协议，了解有关我们所提供服务的最新信息。在本公司修改本协议条款后，如果您不接受修改后的条款，请立即停止使用5G测速大师，您继续使用5G测速大师将被视为已接受了修改后的协议。</p>
			<p>7.其他</p>
			<p>本公司郑重提醒您注意本协议中免除本公司责任和加重您义务的条款，请您仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。以上各项条款内容的最终解释权及修改权归本公司所有。</p>
			<p>本协议所定的任何条款的部分或全部无效者，不影响其它条款的效力。</p>
			<p>本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。若您和本公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议通过杭州市西湖区人民法院通过诉讼解决。</p>
			<p>本协议的著作权由本公司所有，本公司保留对上述条例的最终解释权。</p>
			<p>本声明自更新之日起生效 </p>
			<p>最近的更新日期：2021 年 01 月 15 日</p>
			<p>杭州鸿大网络发展股份有限公司</p> 
		</div>

	</div>
</template>

<script>
	export default {
		name: 'agreement',
		data() {
			return {

			}
		},
		methods: {
			back() {
				this.$router.back()
			},
			}


	}
</script>

<style scoped="scoped" lang="less">
	.title {
		height: 1.67rem;
		line-height: 1.67rem;
		text-align: center;
		position: relative;
		font-size: 0.444rem;

		img {
			display: block;
			position: absolute;
			top: 0;
			bottom: 0;
			margin: auto;
			width: 0.222rem;
			left: 0.556rem;
		}
	}

	p {
		margin: 10px;
		font-size: 16px;
		opacity: 0.8;
	}
</style>
