<template>
	<div>

		<div class="title">
			<img src="../assets/arrow.png" @click="back">
			5G测速大师隐私协议
		</div>
		<div>
			<p>引言：</p>
			<p>本隐私协议是您与本公司之间关于使用“5G测速大师”服务所订立的隐私协议。本隐私协议描述本公司与您之间关于本软件服务相关方面的权利义务。在此特别提醒您在使用本软件前认真阅读、充分理解本隐私协议（下称“隐私协议”）。您在手机或其他设备（以下统称“设备”）上使用5G测速大师（下称“本软件”）即表明您已经阅读、理解并同意受本协议条款和其他适用法律约束。</p>
			<p>一、信息的收集：</p>
			<p>我们会按照如下方式收集您在使用服务时主动提供的，以及您在使用功能或接受服务过程中产生的信息：</p>
			<p>1.保障“5G测速大师”及服务的正常运行</p>
			<p>当您使用“5G测速大师”及相关服务时，为了保障软件与服务的正常运行，我们会收集您的硬件型号、操作系统版本号、网络设备硬件地址（MAC）、IP地址、软件版本号、网络接入方式及类型、操作日志等信息。请您了解，这些信息是我们提供服务和保障产品正常运行所必须收集的基本信息。</p>
			<p>2.为您提供“5G测速大师”等功能或服务</p>
			<p>（1）“5G测速大师”功能需要获取设备信息权限以用于根据不同的设备及系统版本来提供不同的功能和体验，获取产品的使用情况及Bug信息，帮助我们不断改进产品功能和体验。</p>
			<p>（2）“5G测速大师”软件需要获取“创建桌面图标权限”，创建快捷方式，方便下次直接使用软件。</p>
			<p>3.其他第三方统计代码分享您的信息</p>
			<p>（1）您在使用我们产品的过程中，为了减少Bug影响您的使用，以及根据您的行为习惯,更改交互提升使用体验，我们将上传行为信息及崩溃日志至轻粒子快应用统计平台，用于统计详细崩溃日志以及行为分析。</p>
			<p>4.保障产品、服务及用户使用安全</p>
			<p>为帮助我们更好地了解“5G测速大师”及相关服务的运行情况，以便确保运行与提供服务的安全，我们使用第三方统计工具记录网络日志信息，以及使用软件及相关服务的频率、崩溃数据、总体安装、使用情况、性能数据等信息。</p>
			<p>请您了解，我们收集、使用上述信息时进行了去标识化处理/匿名化处理，数据分析仅对应特定的、无法直接关联用户身份的编码。</p>
			<p>（一）收集、使用个人信息目的变更的处理</p>
			<p>请您了解，随着我们业务的发展，可能会对“5G测速大师”的功能和提供的服务有所调整变化。原则上，当新功能或服务与5G测速大师等场景相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次进行告知，并征得您的同意。</p>
			<p>（二）依法豁免征得同意收集和使用的个人信息</p>
			<p>请您理解，在下列情形中，根据法律法规和/或相关国家标准，我们收集和使用您的个人信息无需征得您的授权同意：</p>
			<p>（1）与国家安全、国防安全直接相关的；</p>
			<p>（2）与公共安全、公共卫生、重大公共利益直接相关的；</p>
			<p>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
			<p>（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
			<p>（5）所收集的您的个人信息是您自行向社会公众公开的；</p>
			<p>（6）从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</p>
			<p>（7）根据您的要求签订和履行合同所必需的；</p>
			<p>（8）法律法规规定的其他情形。</p>
			<p>特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，则在结合使用期间，这些信息将作为您的个人信息按照本隐私政策处理与保护。</p>
			<p>二、对Cookie和同类技术的使用</p>
			<p>Cookie 和同类技术是互联网中的通用常用技术。当您使用“5G测速大师”软件及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie
				或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们可能会设置认证与保障安全性的cookie
				或匿名标识符，保障产品与服务的安全、高效运转，帮助我们改进服务效率，提升登录和响应速度。使用此类技术也可以帮助您省去重复选择个性化设置的步骤和流程（例如：测速历史记录），帮助您获得更轻松的访问体验。</p>
			<p>三、信息的使用:</p>
			<p>我们可将所收集的您的信息用于：</p>
			<p>提供、维护和改善我们的有关服务，包括但不限于，提供您申请的产品和服务（及发送相关信息）、开发新功能、提供客户支持、开发安全功能、验证用户、发送产品更新和管理消息等；
			</p>
			<p>执行内部运营，包括，防止欺诈和滥用我们的有关服务；解决软件错误和操作问题；进行数据分析、测试和研究；监控和分析本软件的使用情况和运行状态；</p>
			<p>使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应；</p>
			<p>根据适用法律向您提供与您更加相关的广告以替代普遍投放的广告； </p>
			<p>评估我们服务中的广告和其他促销及推广活动的效果，个性化和改善有关服务，包括提供或推荐功能、内容、引荐和广告；</p>
			<p>软件认证或管理软件升级；</p>
			<p>让您参与有关我们产品和服务的调查。</p>
			<p>四、您的权利</p>
			<p>我们非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的访问、修改（更新或更正）、删除以及撤回授权同意的权利，以使您拥有充分的能力保障您的隐私和安全。</p>
			<p>您可以通过关闭功能、在设备设置中更改应用程序权限等方式撤回您的同意，改变您授权我们继续收集个人信息的范围或撤回您的授权。请您理解，特定的业务功能和服务将需要您的信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的功能和服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。</p>
			<p>五、未成年人条款</p>
			<p>若您是未满18 周岁的未成年人，在使用“5G测速大师”软件及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。</p>
			<p>我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、共享或披露未成年人的个人信息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。</p>
			<p>若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过本隐私政策公示的联系方式与我们联系。</p>
			<p>六、保护您隐私郑重声明</p>
			<p>5G测速大师不会未经您许可获取您的隐私信息,包括但不限于身份信息、WiFi密码、网络访问记录、银行账号以及其他财务类信息，除本隐私协议中另有规定的情形外，5G测速大师不会对外披露或向第三方提供您的任何信息。</p>
			<p>本条隐私权声明不适用于任何向您提供服务的第三方主体，包括那些可能向5G测速大师披露信息的第三方。</p>
			<p>本公司不承担用户的如下风险：</p>
			<p>（1）因不可抗拒因素可能引起的个人信息丢失、泄露等风险；</p>
			<p>（2）用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的用户隐私泄露的风险。</p>
			<p>七、本隐私协议的变更</p>
			<p>5G测速大师有权在任何时间修改本协议条款，并于公布在平台之时起生效。如果5G测速大师对我们处理您个人信息的方式或本协议做出重大变更，我们将通过有关服务向您提供通知。我们鼓励您定期阅读本协议，了解有关我们隐私实务的最新信息。
				在本公司修改隐私协议条款后，如果您不接受修改后的条款，请立即停止使用5G测速大师，您继续使用5G测速大师将被视为已接受了修改后的协议。</p>
			<p>八、如何联系我们</p>
			<p>1.如对本隐私政策内容有任何疑问、意见或建议，您可发送邮件至310372207@qq.com与我们联系。</p>
			<p>2.如果您认为我们违反法律法规规定或与您的约定收集、使用您的个人信息，您也可以通过发送电子邮件（310372207@qq.com）方式与我们取得联系，并要求删除您的相关个人信息。我们将尽快确认所涉问题，并由专人验证您的用户身份后及时予以回复与处理。</p>
			<p>九、其他</p>
			<p>（1）本公司郑重提醒您注意本隐私协议中免除本公司责任和加重您义务的条款，请您仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本隐私协议。以上各项条款内容的最终解释权及修改权归本公司所有。</p>
			<p>（2）本隐私协议所定的任何条款的部分或全部无效者，不影响其它条款的效力。 </p>
			<p>（3）本隐私协议的解释、效力及纠纷的解决，适用中华人民共和国法律。若您和本公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交杭州市西湖区人民法院通过诉讼方式解决。
			</p>
			<p>（4）本隐私协议的版权由本公司所有，本公司保留对上述条款的最终解释权。</p>
			<p>（5）若您对本隐私协议及本软件服务有任何意见，欢迎垂询本公司客服中心。</p>
			<p>杭州鸿大网络发展股份有限公司</p>
			<p>2021年1月</p> 
		</div>

	</div>
</template>

<script>
	export default {
		name: 'privacy',
		data() {
			return {

			}
		},
		methods: {
			back() {
				this.$router.back()
			},
			}


	}
</script>

<style scoped="scoped" lang="less">
	.title {
		height: 1.67rem;
		line-height: 1.67rem;
		text-align: center;
		position: relative;
		font-size: 0.444rem;

		img {
			display: block;
			position: absolute;
			top: 0;
			bottom: 0;
			margin: auto;
			width: 0.222rem;
			left: 0.556rem;
		}
	}

	p {
		margin: 10px;
		font-size: 16px;
		opacity: 0.8;
	}
</style>
